In [202]:
import sqlite3
import pandas as pd

In [203]:
con = sqlite3.connect('sqlite_db_pythonsqlite.db')

In [204]:
cur = con.cursor()

In [205]:
rs = cur.execute('select * from Bookings')
df_booking = pd.DataFrame(cur.fetchall())
df_booking.head()

   0  1  2                    3  4
0  0  3  1  2012-07-03 11:00:00  2
1  1  4  1  2012-07-03 08:00:00  2
2  2  6  0  2012-07-03 18:00:00  2
3  3  7  1  2012-07-03 19:00:00  2
4  4  8  1  2012-07-03 10:00:00  1

In [206]:
rs = cur.execute('select * from Facilities')
df_facilities = pd.DataFrame(cur.fetchall())
df_facilities.head()

   0                1    2     3      4     5
0  0   Tennis Court 1  5.0  25.0  10000   200
1  1   Tennis Court 2  5.0  25.0   8000   200
2  2  Badminton Court  0.0  15.5   4000    50
3  3     Table Tennis  0.0   5.0    320    10
4  4   Massage Room 1  9.9  80.0   4000  3000

In [207]:
rs = cur.execute('select * from Members')
df_members = pd.DataFrame(cur.fetchall())
df_members.head()

,0,1,2,3,4,5,6,7
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

# Q10

In [208]:
cur.execute("""SELECT 
                    f.name, 
                    SUM(f.revenue) as total_revenue
                FROM (SELECT 
                          sub_f.name,
                          CASE WHEN sub_b.memid = 0 THEN sub_f.guestcost 
                            ELSE sub_f.membercost END AS revenue,
                          sub_f.facid
                      FROM Facilities AS sub_f
                      LEFT JOIN Bookings AS sub_b
                      ON sub_f.facid = sub_b.facid) as f
                GROUP BY f.facid
                HAVING total_revenue < 1000
                ORDER BY total_revenue;""")
print(cur.fetchall())

[('Table Tennis', 90), ('Snooker Table', 115), ('Pool Table', 265), ('Badminton Court', 604.5)]

# Q11

In [209]:
cur.execute("""SELECT 
                    m.firstname || ' ' || m.surname,
                    CASE WHEN m.recommendedby in (SELECT memid FROM Members) 
                    THEN m1.firstname||' '||m1.surname END AS recommender
                FROM Members as m
                LEFT JOIN Members as m1
                on m.recommendedby = m1.memid;""")
print(cur.fetchall())

[('GUEST GUEST', None), ('Darren Smith', None), ('Tracy Smith', None), ('Tim Rownam', None), ('Janice Joplette', 'Darren Smith'), ('Gerald Butters', 'Darren Smith'), ('Burton Tracy', None), ('Nancy Dare', 'Janice Joplette'), ('Tim Boothe', 'Tim Rownam'), ('Ponder Stibbons', 'Burton Tracy'), ('Charles Owen', 'Darren Smith'), ('David Jones', 'Janice Joplette'), ('Anne Baker', 'Ponder Stibbons'), ('Jemima Farrell', None), ('Jack Smith', 'Darren Smith'), ('Florence Bader', 'Ponder Stibbons'), ('Timothy Baker', 'Jemima Farrell'), ('David Pinker', 'Jemima Farrell'), ('Matthew Genting', 'Gerald Butters'), ('Anna Mackenzie', 'Darren Smith'), ('Joan Coplin', 'Timothy Baker'), ('Ramnaresh Sarwin', 'Florence Bader'), ('Douglas Jones', 'David Jones'), ('Henrietta Rumney', 'Matthew Genting'), ('David Farrell', None), ('Henry Worthington-Smyth', 'Tracy Smith'), ('Millicent Purview', 'Tracy Smith'), ('Hyacinth Tupperware', None), ('John Hunt', 'Millicent Purview'), ('Erica Crumpet', 'Tracy Smith'), ('Darren Smith', None)]

# Q12

In [361]:
cur.execute("""SELECT 
                    f.name, 
                    COUNT(b.facid)/(SELECT COUNT(*)*1.0 FROM Bookings WHERE bookid != 0)*100 AS usage_percentage
                FROM Facilities AS f
                LEFT JOIN Bookings AS b
                ON f.facid = b.facid
                WHERE b.bookid != 0
                GROUP BY f.facid
                ;""")
print(cur.fetchall())

[('Tennis Court 1', 10.094012864918357), ('Tennis Court 2', 9.623948540326571), ('Badminton Court', 9.475507174666006), ('Table Tennis', 9.945571499257793), ('Massage Room 1', 15.561603166749133), ('Massage Room 2', 2.7461652647204358), ('Squash Court', 10.885700148441366), ('Snooker Table', 10.984661058881743), ('Pool Table', 20.682830282038594)]

# Q13

In [393]:
cur.execute("""SELECT 
                    f.name, 
                    b2.month,
                    (b1.usage*1.0
                    /
                    b2.total_usage*1.0
                    )*100.0 AS monthly_usage_percentage
                FROM Facilities AS f
                LEFT JOIN (SELECT 
                                COUNT(strftime('%m',starttime)) as usage, 
                                strftime('%m',starttime) as month,
                                facid,
                                bookid
                            FROM Bookings
                            WHERE bookid != 0
                            GROUP BY strftime('%m',starttime), facid) AS b1
                ON f.facid = b1.facid
                LEFT JOIN (SELECT 
                                COUNT(strftime('%m',starttime)) as total_usage, 
                                strftime('%m',starttime) as month,
                                facid,
                                bookid
                            FROM Bookings
                            WHERE bookid != 0
                            GROUP BY strftime('%m',starttime)) AS b2
                ON b1.month = b2.month
                ;""")
print(cur.fetchall())

[('Tennis Court 1', '07', 13.39421613394216), ('Tennis Court 1', '08', 9.918478260869565), ('Tennis Court 1', '09', 9.09566126502875), ('Tennis Court 2', '07', 10.350076103500761), ('Tennis Court 2', '08', 10.122282608695652), ('Tennis Court 2', '09', 8.991113434396237), ('Badminton Court', '07', 8.52359208523592), ('Badminton Court', '08', 9.918478260869565), ('Badminton Court', '09', 9.46157867224255), ('Table Tennis', '07', 7.610350076103501), ('Table Tennis', '08', 9.986413043478262), ('Table Tennis', '09', 10.716152639832725), ('Massage Room 1', '07', 18.72146118721461), ('Massage Room 1', '08', 15.217391304347828), ('Massage Room 1', '09', 14.741244119184527), ('Massage Room 2', '07', 1.82648401826484), ('Massage Room 2', '08', 2.717391304347826), ('Massage Room 2', '09', 3.0841610036591742), ('Squash Court', '07', 11.415525114155251), ('Squash Court', '08', 11.548913043478262), ('Squash Court', '09', 10.193413486670151), ('Snooker Table', '07', 11.415525114155251), ('Snooker Table', '08', 10.801630434782608), ('Snooker Table', '09', 10.977522216414009), ('Pool Table', '07', 16.7427701674277), ('Pool Table', '08', 19.769021739130434), ('Pool Table', '09', 22.739153162571878)]